{"keras_version": "1.1.2", "config": [{"config": {"output_shape": [66, 200, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda><\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "name": "Normalization", "function_type": "lambda", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-05}, "activation": "elu", "W_constraint": null, "border_mode": "valid", "name": "Conv2D1", "activity_regularizer": null, "trainable": true, "nb_filter": 24, "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "DropoutC1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activation": "elu", "W_constraint": null, "border_mode": "valid", "name": "Conv2D2", "activity_regularizer": null, "trainable": true, "nb_filter": 36, "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "DropoutC2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activation": "elu", "W_constraint": null, "border_mode": "valid", "name": "Conv2D3", "activity_regularizer": null, "trainable": true, "nb_filter": 48, "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "DropoutC3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activation": "elu", "W_constraint": null, "border_mode": "valid", "name": "Conv2D4", "activity_regularizer": null, "trainable": true, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "DropoutC4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activation": "elu", "W_constraint": null, "border_mode": "valid", "name": "Conv2D5", "activity_regularizer": null, "trainable": true, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "DropoutC5", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "input_dim": null, "activation": "elu", "W_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "name": "Dense1", "bias": true}, "class_name": "Dense"}, {"config": {"name": "DropoutD1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 50, "input_dim": null, "activation": "elu", "W_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "name": "Dense2", "bias": true}, "class_name": "Dense"}, {"config": {"name": "DropoutD2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 10, "input_dim": null, "activation": "elu", "W_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "name": "Dense3", "bias": true}, "class_name": "Dense"}, {"config": {"name": "DropoutD3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "input_dim": null, "activation": "elu", "W_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "name": "Output", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}