{"keras_version": "1.1.2", "config": [{"config": {"output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>a\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "input_dtype": "float32", "arguments": {}, "batch_input_shape": [null, 32, 64, 3], "name": "Normalization", "output_shape": [32, 64, 3], "trainable": true}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "b_constraint": null, "nb_filter": 32, "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "subsample": [1, 1], "nb_col": 5, "trainable": true, "nb_row": 5, "name": "Conv2D1"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [4, 4], "name": "MaxPool1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.3, "name": "DropoutC1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "b_constraint": null, "nb_filter": 16, "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "nb_col": 3, "trainable": true, "nb_row": 3, "name": "Conv2D2"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "MaxPool2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.3, "name": "DropoutC2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "bias": true, "b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 10, "name": "Dense1"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "DropoutD1"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "bias": true, "b_regularizer": null, "activation": "elu", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 1, "name": "Output"}, "class_name": "Dense"}], "class_name": "Sequential"}